app/controllers/home_controller.rb

SELECT "products".* FROM "products"
---
  def home
    @products = Product.all