app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "rarity", "user_id", "created_at", "updated_at", "sold") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
      @product = Product.new(product_params)
      respond_to do |format|
        if @product.save

UPDATE "products" SET "updated_at" = $1 WHERE "products"."id" = $2  [["updated_at", "2023-11-20 21:22:35.223552"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]
---
  def destroy
    @product.delete