app/controllers/trade_offers_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_requested_product
    @requested_product = Product.find_by(id: params[:product_id])