app/controllers/trade_offers_controller.rb

  def new
    @requested_product = Product.find_by(id: params[:product_id])
    @trade_offer = current_user.sent_trade_offers.new(receiver_id: params[:receiver_id],
                                                      requested_product_id: params[:product_id])
    @offered_products = current_user.products.where.not(id: params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."id" != $2  [["user_id", 1], ["id", 3]]

  def create
    @trade_offer = current_user.sent_trade_offers.build(trade_offer_params)
    if @trade_offer.save
      offered_product_ids = trade_offer_params[:offered_product_ids].reject(&:blank?)
      offered_product_ids.each do |product_id|
        @trade_offer.trade_offer_items.create(product_id: product_id)
      end
      redirect_to @trade_offer, notice: "La oferta de intercambio se ha creado correctamente"
    else
      @offered_products = current_user.products.where.not(id: @trade_offer.requested_product_id)
---
INSERT INTO "trade_offers" ("sender_id", "receiver_id", "status", "message", "created_at", "updated_at", "requested_product_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["sender_id", 2], ["receiver_id", 1], ["status", nil], ["message", "aaaa"], ["created_at", "2023-11-21 23:16:59.632172"], ["updated_at", "2023-11-21 23:16:59.632172"], ["requested_product_id", 2]]
INSERT INTO "trade_offer_items" ("trade_offer_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["trade_offer_id", 1], ["product_id", 3], ["created_at", "2023-11-21 23:16:59.648522"], ["updated_at", "2023-11-21 23:16:59.648522"]]
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1  [["user_id", 1]]

  def set_trade_offer
    @trade_offer = TradeOffer.find(params[:id])
---
SELECT "trade_offers".* FROM "trade_offers" WHERE "trade_offers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]