app/views/products/show.html.erb

SELECT 1 AS one FROM "products" WHERE "products"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
<% if user_signed_in? && current_user != @product.user %>
  <% if current_user.products.any? %>